Revit 2026 API

# IFCExtrusionCreationDataGetOpenings Method

---

Gets a collection of all of the openings stored in this data.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<IFCExtrusionData> GetOpenings()
```
```vb
Public Function GetOpenings As IList(Of IFCExtrusionData)
```
```cpp
public:
IList<IFCExtrusionData^>^ GetOpenings()
```
```fsharp
member GetOpenings : unit -> IList<IFCExtrusionData>
```

#### Return Value

IListIFCExtrusionData The opening information.

Contains all of the openings stored via AddOpening().

#### Reference

IFCExtrusionCreationData Class

Autodesk.Revit.DB.IFC Namespace